In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
    [
        [23, 19, 101],
        [np.nan, 44, 55],
        [np.nan, 56, np.nan]
    ],
    index=['A', 'B', 'C'],
    columns=['C1', 'C2', 'C3']
    )

In [3]:
df

     C1  C2     C3
A  23.0  19  101.0
B   NaN  44   55.0
C   NaN  56    NaN

In [ ]:
df.dropna()  # drop the entire rows that have NaN values, but it'll not affect df unless i passed "inplace=True" as a parameter to dropna()

     C1  C2     C3
A  23.0  19  101.0

In [ ]:
df.dropna(axis=1)  # axis=1 means rop the entire column not the row that has a NaN value, and also i can use "inplace=True" here

   C2
A  19
B  44
C  56

In [ ]:
df.dropna(axis=1, thresh=2)  # "thresh" means allow NaN values if they are less than 2 values, 2 values or more are not allowed

   C2     C3
A  19  101.0
B  44   55.0
C  56    NaN

In [8]:
df.fillna( df['C2'].sum() )  # replace NaN values with summation of C2 values

      C1  C2     C3
A   23.0  19  101.0
B  119.0  44   55.0
C  119.0  56  119.0